Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadVAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadVAddr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadVAddr" edc:desc="" edc:mask="0xffffffff" edc:name="BadVAddr" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadInstr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadInstr" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="288">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadInstr" edc:desc="" edc:mask="0xffffffff" edc:name="BadInstr" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BadInstrP" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="BadInstrP" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="416">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BadInstrP" edc:desc="" edc:mask="0xffffffff" edc:name="BadInstrP" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Count" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Count" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Count" edc:desc="" edc:mask="0xffffffff" edc:name="Count" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnn-----nnnnnnnnn" edc:cname="EntryHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EntryHi" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VPN2" edc:desc="" edc:mask="0x7ffff" edc:name="VPN2" edc:nzwidth="0x13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Compare" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Compare" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="172">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Compare" edc:desc="" edc:mask="0xffffffff" edc:name="Compare" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn-nnnnn-nnnnnnn-----n-nnn" edc:cname="Status" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00u00u00010000000000000000000000" edc:name="Status" edc:nmmrflags="0t" edc:nzwidth="0x20" edc:por="00x00x00010000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="176">
        <edc:SFRModeList>
          <edc:SFRMode edc:access="" edc:id="DS.0" edc:mclr="" edc:por="">
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERL" edc:desc="" edc:mask="0x1" edc:name="ERL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UM" edc:desc="" edc:mask="0x1" edc:name="UM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7f" edc:name="IPL" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IPL7" edc:desc="" edc:mask="0x1" edc:name="IPL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="" edc:mask="0x1" edc:name="NMI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR" edc:desc="" edc:mask="0x1" edc:name="SR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEV" edc:desc="" edc:mask="0x1" edc:name="BEV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MX" edc:desc="" edc:mask="0x1" edc:name="MX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0x1" edc:name="RE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR" edc:mask="0x1" edc:name="FR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="" edc:mask="0x1" edc:name="RP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CU0" edc:desc="" edc:mask="0x1" edc:name="CU0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CU1" edc:mask="0x1" edc:name="CU1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------nnnnnnnnnn---nnnnn-----" edc:cname="IntCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IntCtl" edc:nmmrflags="0a" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:nmmrid="304">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VS" edc:desc="" edc:mask="0x1f" edc:name="VS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USESTK" edc:desc="" edc:mask="0x1" edc:name="USESTK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APE" edc:desc="" edc:mask="0x1" edc:name="APE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLREXL" edc:desc="" edc:mask="0x1" edc:name="CLREXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKDEC" edc:desc="" edc:mask="0x1f" edc:name="STKDEC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ICE" edc:desc="" edc:mask="0x1" edc:name="ICE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PF" edc:desc="" edc:mask="0x1" edc:name="PF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
