Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
              <edc:DCRFieldSemantic edc:cname="MUL_124" edc:desc="PLL Multiply by 124" edc:when="(field &amp; 0x7F) == 0x7b"/>
              <edc:DCRFieldSemantic edc:cname="MUL_125" edc:desc="PLL Multiply by 125" edc:when="(field &amp; 0x7F) == 0x7c"/>
              <edc:DCRFieldSemantic edc:cname="MUL_126" edc:desc="PLL Multiply by 126" edc:when="(field &amp; 0x7F) == 0x7d"/>
              <edc:DCRFieldSemantic edc:cname="MUL_127" edc:desc="PLL Multiply by 127" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:DCRFieldSemantic edc:cname="MUL_128" edc:desc="PLL Multiply by 128" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLODIV" edc:desc="System PLL Output Clock Divider" edc:mask="0x7" edc:name="FPLLODIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="8x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_16" edc:desc="16x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="32x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBATBOREN" edc:desc="VBAT BOR Enable" edc:mask="0x1" edc:name="VBATBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable ZPBOR during VBAT Mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable ZPBOR during VBAT Mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep BOR Enable" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable ZPBOR during Deep Sleep Mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable ZPBOR during Deep Sleep Mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="DSWDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="DSPS1" edc:desc="1:2^5" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DSPS2" edc:desc="1:2^6" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSPS3" edc:desc="1:2^7" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSPS4" edc:desc="1:2^8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSPS5" edc:desc="1:2^9" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSPS6" edc:desc="1:2^10" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSPS7" edc:desc="1:2^11" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSPS8" edc:desc="1:2^12" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSPS9" edc:desc="1:2^13" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSPS10" edc:desc="1:2^14" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSPS11" edc:desc="1:2^15" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSPS12" edc:desc="1:2^16" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSPS13" edc:desc="1:2^17" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSPS14" edc:desc="1:2^18" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSPS15" edc:desc="1:2^19" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSPS16" edc:desc="1:2^20" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSPS17" edc:desc="1:2^21" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DSPS18" edc:desc="1:2^22" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DSPS19" edc:desc="1:2^23" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DSPS20" edc:desc="1:2^24" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DSPS21" edc:desc="1:2^25" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DSPS22" edc:desc="1:2^26" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DSPS23" edc:desc="1:2^27" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DSPS24" edc:desc="1:2^28" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="DSPS25" edc:desc="1:2^29" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="DSPS26" edc:desc="1:2^30" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="DSPS27" edc:desc="1:2^31" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="DSPS28" edc:desc="1:2^32" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="DSPS29" edc:desc="1:2^33" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="DSPS30" edc:desc="1:2^34" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="DSPS31" edc:desc="1:2^35" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="DSPS32" edc:desc="1:2^36" edc:when="(field &amp; 0x1f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="Deep Sleep WDT Reference Clock Selection" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Select SOSC as DSWDT Reference Clock" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Select LPRC as DSWDT Reference clock" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable DSWDT during Deep Sleep Mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable DSWDT during Deep Sleep Mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FDSEN" edc:desc="Deep Sleep Enable" edc:mask="0x1" edc:name="FDSEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable DSEN bit in DSCON" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enable DSEN bit in DSCON" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORSEL" edc:desc="Brown-out trip voltage" edc:mask="0x1" edc:name="BORSEL" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="BOR trip voltage 2.1v (Non-OPAMP deviced operation)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LOW" edc:desc="BOR trip voltage 2.8v (OPAMP deviced operation)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="UPLLEN" edc:desc="USB PLL Enable" edc:mask="0x1" edc:name="UPLLEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USB PLL Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USB PLL Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
