Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB14R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="25" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801678">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:desc="" edc:mask="0x1f" edc:name="RPB14R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="26" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80167C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0x1f" edc:name="RPB15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC0R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="27" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:desc="" edc:mask="0x1f" edc:name="RPC0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="28" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801684">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0x1f" edc:name="RPC1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="29" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801688">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0x1f" edc:name="RPC2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x04" edc:_addr="0x1F80168C"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC4R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="30" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801690">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC4R" edc:desc="" edc:mask="0x1f" edc:name="RPC4R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F801694"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC6R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="32" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801698">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC6R" edc:desc="" edc:mask="0x1f" edc:name="RPC6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC7R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="33" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80169C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC7R" edc:desc="" edc:mask="0x1f" edc:name="RPC7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC8R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="34" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC8R" edc:desc="" edc:mask="0x1f" edc:name="RPC8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC9R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="35" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC9R" edc:desc="" edc:mask="0x1f" edc:name="RPC9R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC10R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="36" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC10R" edc:desc="" edc:mask="0x1f" edc:name="RPC10R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x04" edc:_addr="0x1F8016AC"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC12R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="37" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC12R" edc:desc="" edc:mask="0x1f" edc:name="RPC12R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x08" edc:_addr="0x1F8016B4"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPC15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPC15R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="38" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC15R" edc:desc="" edc:mask="0x1f" edc:name="RPC15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x0c" edc:_addr="0x1F8016C0"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPD3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPD3R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="39" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8016CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPD3R" edc:desc="" edc:mask="0x1f" edc:name="RPD3R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
