Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF034" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF034" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105C8">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF035" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF035" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105CC">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF036" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF036" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF037" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF037" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105D4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF038" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF038" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105D8">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF039" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF039" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105DC">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF040" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF040" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF041" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF041" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105E4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF042" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF042" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105E8">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF043" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF043" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105EC">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF044" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF044" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8105F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
