Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF063" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF063" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81063C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF064" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF064" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810640">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF065" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF065" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810644">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF066" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF066" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810648">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF067" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF067" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81064C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF068" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF068" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810650">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF069" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF069" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810654">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF070" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF070" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810658">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF071" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF071" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81065C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF072" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF072" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810660">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
