Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1BUF" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="SPI1BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="SPI1" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="SPI1BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnnnnnnnnnn" edc:cname="SPI1BRG" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxxxxxxxxxxxx" edc:name="SPI1BRG" edc:nzwidth="0x20" edc:por="-------------------xxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BRG" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="SPI1BRG" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnn---n-nn" edc:cname="SPI1CON2" edc:desc="" edc:impl="0x9f8b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--xxxxxx---x-xx" edc:name="SPI1CON2" edc:nzwidth="32" edc:por="----------------x--xxxxxx---x-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827040">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AUDMOD" edc:desc="" edc:mask="0x3" edc:name="AUDMOD" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AUDMONO" edc:desc="" edc:mask="0x1" edc:name="AUDMONO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AUDEN" edc:desc="" edc:mask="0x1" edc:name="AUDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNTUR" edc:desc="" edc:mask="0x1" edc:name="IGNTUR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNROV" edc:desc="" edc:mask="0x1" edc:name="IGNROV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPITUREN" edc:desc="" edc:mask="0x1" edc:name="SPITUREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPIROVEN" edc:desc="" edc:mask="0x1" edc:name="SPIROVEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRMERREN" edc:desc="" edc:mask="0x1" edc:name="FRMERREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPISGNEXT" edc:desc="" edc:mask="0x1" edc:name="SPISGNEXT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AUDMOD0" edc:desc="" edc:mask="0x1" edc:name="AUDMOD0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUDMOD1" edc:desc="" edc:mask="0x1" edc:name="AUDMOD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="432" edc:_addr="0x1F827050"/>
      <edc:SFRDef edc:access="nnnnnnnnn-----nnnnnnnnnnnnnnnnnn" edc:cname="SPI2CON" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000x-----0000000000000x0000" edc:name="SPI2CON" edc:nzwidth="0x20" edc:por="00000000x-----0000000000000x0000" edc:portals="CLR SET INV" ltx:baseofperipheral="SPI2" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827200">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SRXISEL" edc:desc="" edc:mask="0x3" edc:name="SRXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="STXISEL" edc:desc="" edc:mask="0x3" edc:name="STXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DISSDI" edc:desc="" edc:mask="0x1" edc:name="DISSDI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE32" edc:desc="" edc:mask="0x1" edc:name="MODE32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENHBUF" edc:desc="" edc:mask="0x1" edc:name="ENHBUF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIFE" edc:desc="" edc:mask="0x1" edc:name="SPIFE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="MCLKSEL" edc:desc="" edc:mask="0x1" edc:name="MCLKSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRMCNT" edc:desc="" edc:mask="0x7" edc:name="FRMCNT" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FRMSYPW" edc:desc="" edc:mask="0x1" edc:name="FRMSYPW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:desc="" edc:mask="0x1" edc:name="MSSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMPOL" edc:desc="" edc:mask="0x1" edc:name="FRMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMSYNC" edc:desc="" edc:mask="0x1" edc:name="FRMSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="SPI/I2S 2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---rrrrr---rrrrr---nr--rrrr-r-rr" edc:cname="SPI2STAT" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---x0--0000-0-00" edc:name="SPI2STAT" edc:nzwidth="0x20" edc:por="---00000---00000---x0--0000-0-00" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI2" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827210">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITBF" edc:desc="" edc:mask="0x1" edc:name="SPITBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPITBE" edc:desc="" edc:mask="0x1" edc:name="SPITBE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPIRBE" edc:desc="" edc:mask="0x1" edc:name="SPIRBE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRMT" edc:desc="" edc:mask="0x1" edc:name="SRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITUR" edc:desc="" edc:mask="0x1" edc:name="SPITUR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPIBUSY" edc:desc="" edc:mask="0x1" edc:name="SPIBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMERR" edc:desc="" edc:mask="0x1" edc:name="FRMERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TXBUFELM" edc:desc="" edc:mask="0x1f" edc:name="TXBUFELM" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXBUFELM" edc:desc="" edc:mask="0x1f" edc:name="RXBUFELM" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI2BUF" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="SPI2BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="SPI2" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827220">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI2BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="SPI2BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nnnnnnnnnnnnn" edc:cname="SPI2BRG" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------xxxxxxxxxxxxx" edc:name="SPI2BRG" edc:nzwidth="0x20" edc:por="-------------------xxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI2" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827230">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI2BRG" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="SPI2BRG" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnn---n-nn" edc:cname="SPI2CON2" edc:desc="" edc:impl="0x9f8b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--xxxxxx---x-xx" edc:name="SPI2CON2" edc:nzwidth="32" edc:por="----------------x--xxxxxx---x-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI2" edc:_modsrc="DOS-01329_spi_pb_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F827240">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AUDMOD" edc:desc="" edc:mask="0x3" edc:name="AUDMOD" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AUDMONO" edc:desc="" edc:mask="0x1" edc:name="AUDMONO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AUDEN" edc:desc="" edc:mask="0x1" edc:name="AUDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNTUR" edc:desc="" edc:mask="0x1" edc:name="IGNTUR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IGNROV" edc:desc="" edc:mask="0x1" edc:name="IGNROV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPITUREN" edc:desc="" edc:mask="0x1" edc:name="SPITUREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPIROVEN" edc:desc="" edc:mask="0x1" edc:name="SPIROVEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRMERREN" edc:desc="" edc:mask="0x1" edc:name="FRMERREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPISGNEXT" edc:desc="" edc:mask="0x1" edc:name="SPISGNEXT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AUDMOD0" edc:desc="" edc:mask="0x1" edc:name="AUDMOD0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUDMOD1" edc:desc="" edc:mask="0x1" edc:name="AUDMOD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xdb0" edc:_addr="0x1F827250"/>
      <edc:SFRDef edc:access="--------nn---nnnn-nnnnnnnnnnnnnn" edc:cname="U1MODE" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00---0000000000000000000" edc:name="U1MODE" edc:nzwidth="0x20" edc:por="--------00---0000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="UART1 UARTAB" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F828000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STSEL" edc:desc="" edc:mask="0x1" edc:name="STSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL" edc:desc="" edc:mask="0x3" edc:name="PDSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXINV" edc:desc="" edc:mask="0x1" edc:name="RXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABAUD" edc:desc="" edc:mask="0x1" edc:name="ABAUD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPBACK" edc:desc="" edc:mask="0x1" edc:name="LPBACK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKE" edc:desc="" edc:mask="0x1" edc:name="WAKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN" edc:desc="" edc:mask="0x3" edc:name="UEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RTSMD" edc:desc="" edc:mask="0x1" edc:name="RTSMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IREN" edc:desc="" edc:mask="0x1" edc:name="IREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVFDIS" edc:desc="" edc:mask="0x1" edc:name="OVFDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="RUNOVF" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL0" edc:desc="" edc:mask="0x1" edc:name="PDSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL1" edc:desc="" edc:mask="0x1" edc:name="PDSEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="UEN0" edc:desc="" edc:mask="0x1" edc:name="UEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN1" edc:desc="" edc:mask="0x1" edc:name="UEN1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="USIDL" edc:desc="" edc:mask="0x1" edc:name="USIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UARTEN" edc:desc="" edc:mask="0x1" edc:name="UARTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="UART1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnrrnnnrrrcr" edc:cname="U1STA" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000100010000" edc:name="U1STA" edc:nzwidth="0x20" edc:por="00000000000000000000000100010000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART1 UARTAB" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F828010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXEN" edc:desc="" edc:mask="0x1" edc:name="URXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL" edc:desc="" edc:mask="0x3" edc:name="UTXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0xff" edc:name="ADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="" edc:mask="0xff" edc:name="MASK" edc:nzwidth="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="UTXSEL" edc:desc="" edc:mask="0x1" edc:name="UTXSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------nnnnnnnnn" edc:cname="U1TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U1TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART1 UARTAB" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F828020">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U1TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------rrrrrrrrr" edc:cname="U1RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U1RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART1 UARTAB" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x50" edc:_addr="0x1F828030">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U1RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
