Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:AdjustPoint edc:offset="0x0db0" edc:_addr="0x1F828250"/>
      <edc:SFRDef edc:access="----------------nnnn----nnnnnnnn" edc:cname="EECON" edc:desc="" edc:grp="EE" edc:impl="0xfffff7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000----x0xxx000" edc:name="EECON" edc:nzwidth="0x20" edc:por="----------------0000----00000000" edc:portals="CLR SET INV" ltx:baseofperipheral="EEPROM" edc:_modsrc="DOS-02514_dfm_strl_sst_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F829000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x7" edc:name="CMD" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ILW" edc:mask="0x1" edc:name="ILW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:mask="0x3" edc:name="ERR" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RW" edc:desc="" edc:mask="0x1" edc:name="RW" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:desc="" edc:mask="0x1" edc:name="ABORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------wwwwwwwwwwwwwwww" edc:cname="EEKEY" edc:desc="" edc:grp="EE" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------uuuuuuuuuuuuuuuu" edc:name="EEKEY" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="- - -" ltx:memberofperipheral="EEPROM" edc:_modsrc="DOS-02514_dfm_strl_sst_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F829010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EEKEY" edc:mask="0xffff" edc:name="EEKEY" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnnnnnnnnnn" edc:cname="EEADDR" edc:desc="" edc:grp="EE" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="EEADDR" edc:nzwidth="0x20" edc:por="------------------00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="EEPROM" edc:_modsrc="DOS-02514_dfm_strl_sst_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F829020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EEADDR" edc:mask="0x3fff" edc:name="EEADDR" edc:nzwidth="0xe"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EEDATA" edc:desc="" edc:grp="EE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EEDATA" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="EEPROM" edc:_modsrc="DOS-02514_dfm_strl_sst_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x40" edc:_addr="0x1F829030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EEDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="EEDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x0fc0" edc:_addr="0x1F829040"/>
      <edc:SFRDef edc:access="----------------n-nnnn---nnnnnnn" edc:cname="PTCON" edc:desc="" edc:impl="0xbc7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0000---0000000" edc:name="PTCON" edc:nzwidth="32" edc:por="----------------0-0000---0000000" edc:portals="CLR SET INV" ltx:baseofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTPS" edc:mask="0xf" edc:name="SEVTPS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PCLKDIV" edc:mask="0x7" edc:name="PCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMRDY" edc:mask="0x1" edc:name="PWMRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEIEN" edc:mask="0x1" edc:name="SEIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESTAT" edc:mask="0x1" edc:name="SESTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTSIDL" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTEN" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTPER" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PTPER" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTPER" edc:mask="0xffff" edc:name="PTPER" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SEVTCMP" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTCMP" edc:mask="0xffff" edc:name="SEVTCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMTMR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PMTMR" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMTMR" edc:mask="0xffff" edc:name="PMTMR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------------nn----nnnnnnn" edc:cname="STCON" edc:desc="" edc:impl="0x187f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00----0000000" edc:name="STCON" edc:nzwidth="32" edc:por="-------------------00----0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVTPS" edc:mask="0xf" edc:name="SEVTPS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SCLKDIV" edc:mask="0x7" edc:name="SCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SSEIEN" edc:mask="0x1" edc:name="SSEIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSESTAT" edc:mask="0x1" edc:name="SSESTAT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STPER" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STPER" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STPER" edc:mask="0xffff" edc:name="STPER" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SSEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SSEVTCMP" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="MCPWMMODULE" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa0" edc:_addr="0x1F82A060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSEVTCMP" edc:mask="0xffff" edc:name="SSEVTCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
