Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRIG7" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="TRIG7" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGCMP" edc:mask="0xffff" edc:name="TRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnn------" edc:cname="TRGCON7" edc:desc="" edc:impl="0xffc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000------" edc:name="TRGCON7" edc:nzwidth="32" edc:por="----------------0000000000------" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A750">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="STRGIS" edc:mask="0x1" edc:name="STRGIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTM" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSEL" edc:mask="0x3" edc:name="STRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:mask="0x3" edc:name="TRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGDIV" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG7" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG7" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A760">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP7" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP7" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A770">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnn----------" edc:cname="LEBCON7" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON7" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A780">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="LEBDLY7" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="LEBDLY7" edc:nzwidth="32" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A790">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEB" edc:mask="0xfff" edc:name="LEB" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------nnnnnn" edc:cname="AUXCON7" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="AUXCON7" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A7A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHOPLEN" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPHEN" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPSEL" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTMR7" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PTMR7" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="8" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A7B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:mask="0xffff" edc:name="TMR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnn---nnnnn---nn--nnn-nnnnn-n-" edc:cname="PWMCON8" edc:desc="" edc:impl="0xf8f8cefa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000---00000---00--000-00000-0-" edc:name="PWMCON8" edc:nzwidth="32" edc:por="00000---00000---00--000-00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="9" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A7C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XPRES" edc:mask="0x1" edc:name="XPRES" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MTBS" edc:mask="0x1" edc:name="MTBS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTDIR" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTCP" edc:mask="0x1" edc:name="DTCP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTC" edc:mask="0x3" edc:name="DTC" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ITB" edc:mask="0x1" edc:name="ITB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECAM" edc:mask="0x3" edc:name="ECAM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLTSTAT" edc:mask="0x1" edc:name="CLTSTAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTSTAT" edc:mask="0x1" edc:name="FLTSTAT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMHIEN" edc:mask="0x1" edc:name="PWMHIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLIEN" edc:mask="0x1" edc:name="PWMLIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGIEN" edc:mask="0x1" edc:name="TRGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLIEN" edc:mask="0x1" edc:name="CLIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTIEN" edc:mask="0x1" edc:name="FLTIEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMHIF" edc:mask="0x1" edc:name="PWMHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMLIF" edc:mask="0x1" edc:name="PWMLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGIF" edc:mask="0x1" edc:name="TRGIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLIF" edc:mask="0x1" edc:name="CLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTIF" edc:mask="0x1" edc:name="FLTIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IOCON8" edc:desc="" edc:impl="0x3f7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000-00000000000000000000000" edc:name="IOCON8" edc:nzwidth="32" edc:por="--000000-00000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="9" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A7D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSYNC" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLDAT" edc:mask="0x3" edc:name="CLDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTDAT" edc:mask="0x3" edc:name="FLTDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRDAT" edc:mask="0x3" edc:name="OVRDAT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRENL" edc:mask="0x1" edc:name="OVRENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRENH" edc:mask="0x1" edc:name="OVRENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMOD" edc:mask="0x3" edc:name="PMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="POLL" edc:mask="0x1" edc:name="POLL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POLH" edc:mask="0x1" edc:name="POLH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENL" edc:mask="0x1" edc:name="PENL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENH" edc:mask="0x1" edc:name="PENH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTMOD" edc:mask="0x3" edc:name="FLTMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTPOL" edc:mask="0x1" edc:name="FLTPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTSRC" edc:mask="0xf" edc:name="FLTSRC" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLMOD" edc:mask="0x1" edc:name="CLMOD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLPOL" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLSRC" edc:mask="0xf" edc:name="CLSRC" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDC8" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PDC8" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="9" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82A7E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PDC" edc:mask="0xffff" edc:name="PDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
