Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG12" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG12" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82AC60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP12" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP12" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82AC70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnn----------" edc:cname="LEBCON12" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON12" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82AC80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------nnnnnnnnnnnn" edc:cname="LEBDLY12" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="LEBDLY12" edc:nzwidth="32" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82AC90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEB" edc:mask="0xfff" edc:name="LEB" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------------------nnnnnn" edc:cname="AUXCON12" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="AUXCON12" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82ACA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHOPLEN" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPHEN" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPSEL" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTMR12" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PTMR12" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="13" edc:_begin="0xa0" edc:_end="0x1a0" edc:_addr="0x1F82ACB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:mask="0xffff" edc:name="TMR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x340" edc:_addr="0x1F82ACC0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnn-nnnn-nn-nnnnrr---nn" edc:cname="PTGCON" edc:desc="" edc:grp="NVM" edc:impl="0xffffbff3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxx-xxxx-xxxxxxxxx---xx" edc:name="PTGCON" edc:nzwidth="0x20" edc:por="000000000000-0000-00-000000---00" edc:portals="CLR SET INV" ltx:baseofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGITM" edc:mask="0x3" edc:name="PTGITM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PTGBUSY" edc:mask="0x1" edc:name="PTGBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTO" edc:mask="0x1" edc:name="PTGWDTO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSTRT" edc:mask="0x1" edc:name="PTGSTRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGIVIS" edc:mask="0x1" edc:name="PTGIVIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSSEN" edc:mask="0x1" edc:name="PTGSSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSWT" edc:mask="0x1" edc:name="PTGSWT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESERVED" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGTOGL" edc:mask="0x1" edc:name="PTGTOGL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSIDL" edc:mask="0x1" edc:name="PTGSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PTGON" edc:mask="0x1" edc:name="PTGON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGWDT" edc:mask="0x7" edc:name="PTGWDT" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGPWD" edc:mask="0xf" edc:name="PTGPWD" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PTGDIV" edc:mask="0x1f" edc:name="PTGDIV" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PTGCLK" edc:mask="0x7" edc:name="PTGCLK" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGBTE" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGBTE" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGBTE" edc:mask="0xffffffff" edc:name="PTGBTE" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGHOLD" edc:desc="" edc:grp="NVM" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGHOLD" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGHOLD" edc:mask="0xffff" edc:name="PTGHOLD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGT0LIM" edc:desc="" edc:grp="FLASH" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGT0LIM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGT0LIM" edc:mask="0xffff" edc:name="PTGT0LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
