Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGT1LIM" edc:desc="" edc:grp="FLASH" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGT1LIM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGT1LIM" edc:mask="0xffff" edc:name="PTGT1LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGSDLIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGSDLIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGSDLIM" edc:mask="0xffff" edc:name="PTGSDLIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGC0LIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGC0LIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGC0LIM" edc:mask="0xffff" edc:name="PTGC0LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGC1LIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGC1LIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGC1LIM" edc:mask="0xffff" edc:name="PTGC1LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGADJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGADJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGADJ" edc:mask="0xffff" edc:name="PTGADJ" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGL0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGL0" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGL0" edc:mask="0xffff" edc:name="PTGL0" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="PTGQPTR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="PTGQPTR" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGQPTR" edc:mask="0x1f" edc:name="PTGQPTR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0B0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP0" edc:mask="0xff" edc:name="STEP0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP2" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP3" edc:mask="0xff" edc:name="STEP3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP4" edc:mask="0xff" edc:name="STEP4" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP5" edc:mask="0xff" edc:name="STEP5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP6" edc:mask="0xff" edc:name="STEP6" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP7" edc:mask="0xff" edc:name="STEP7" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP8" edc:mask="0xff" edc:name="STEP8" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP9" edc:mask="0xff" edc:name="STEP9" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP10" edc:mask="0xff" edc:name="STEP10" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP11" edc:mask="0xff" edc:name="STEP11" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B0F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP12" edc:mask="0xff" edc:name="STEP12" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP13" edc:mask="0xff" edc:name="STEP13" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP14" edc:mask="0xff" edc:name="STEP14" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP15" edc:mask="0xff" edc:name="STEP15" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_SIC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x140" edc:_addr="0x1F82B100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP16" edc:mask="0xff" edc:name="STEP16" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP17" edc:mask="0xff" edc:name="STEP17" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP18" edc:mask="0xff" edc:name="STEP18" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP19" edc:mask="0xff" edc:name="STEP19" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
