Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="---------------nnnnnnnnnnnnnrrrr" edc:cname="QEI6IOC" edc:desc="" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0000000000000xxxx" edc:name="QEI6IOC" edc:nzwidth="32" edc:por="---------------0000000000000xxxx" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA" edc:mask="0x1" edc:name="QEA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEB" edc:mask="0x1" edc:name="QEB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:mask="0x1" edc:name="INDEX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOME" edc:mask="0x1" edc:name="HOME" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEAPOL" edc:mask="0x1" edc:name="QEAPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEBPOL" edc:mask="0x1" edc:name="QEBPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPOL" edc:mask="0x1" edc:name="IDXPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMPOL" edc:mask="0x1" edc:name="HOMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWPAB" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTFNC" edc:mask="0x3" edc:name="OUTFNC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QFDIV" edc:mask="0x7" edc:name="QFDIV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FLTREN" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QCAPEN" edc:mask="0x1" edc:name="QCAPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCAPEN" edc:mask="0x1" edc:name="HCAPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nnnnnnnnnnnnnn" edc:cname="QEI6STAT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="QEI6STAT" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDXIEN" edc:mask="0x1" edc:name="IDXIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXIRQ" edc:mask="0x1" edc:name="IDXIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMIEN" edc:mask="0x1" edc:name="HOMIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMIRQ" edc:mask="0x1" edc:name="HOMIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VELOVIEN" edc:mask="0x1" edc:name="VELOVIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VELOVIRQ" edc:mask="0x1" edc:name="VELOVIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCIIEN" edc:mask="0x1" edc:name="PCIIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCIIRQ" edc:mask="0x1" edc:name="PCIIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSOVIEN" edc:mask="0x1" edc:name="POSOVIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSOVIRQ" edc:mask="0x1" edc:name="POSOVIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCLEQIEN" edc:mask="0x1" edc:name="PCLEQIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCLEQIRQ" edc:mask="0x1" edc:name="PCLEQIRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCHEQIEN" edc:mask="0x1" edc:name="PCHEQIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCHEQIRQ" edc:mask="0x1" edc:name="PCHEQIRQ" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="POS6CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="POS6CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POSCNT" edc:mask="0xffffffff" edc:name="POSCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="POS6HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="POS6HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POSHLD" edc:mask="0xffffffff" edc:name="POSHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="VEL6CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="VEL6CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VELCNT" edc:mask="0xffffffff" edc:name="VELCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="VEL6HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="VEL6HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VELHLD" edc:mask="0xffffffff" edc:name="VELHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT6TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT6TMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTTMR" edc:mask="0xffffffff" edc:name="INTTMR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT6HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT6HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTHLD" edc:mask="0xffffffff" edc:name="INTHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
