Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX6CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX6CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXCNT" edc:mask="0xffffffff" edc:name="INDXCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX6HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX6HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXHLD" edc:mask="0xffffffff" edc:name="INDXHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI6ICC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI6ICC" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BCB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEIICC" edc:mask="0xffffffff" edc:name="QEIICC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI6CMPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI6CMPL" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BCC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEICMPL" edc:mask="0xffffffff" edc:name="QEICMPL" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x330" edc:_addr="0x1F82BCD0"/>
      <edc:SFRDef edc:access="-----------rrrrr--n--------rrrrr" edc:cname="CMSTAT" edc:desc="" edc:impl="0x1f201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000--0--------00000" edc:name="CMSTAT" edc:nzwidth="32" edc:por="-----------00000--0--------00000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01427_cmp_control_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F82C000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C4OUT" edc:desc="" edc:mask="0x1" edc:name="C4OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C5OUT" edc:desc="" edc:mask="0x1" edc:name="C5OUT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="C1EVT" edc:desc="" edc:mask="0x1" edc:name="C1EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C2EVT" edc:desc="" edc:mask="0x1" edc:name="C2EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C3EVT" edc:desc="" edc:mask="0x1" edc:name="C3EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C4EVT" edc:desc="" edc:mask="0x1" edc:name="C4EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C5EVT" edc:desc="" edc:mask="0x1" edc:name="C5EVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CMP" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------nnnnnnnnnn-nnnrnn-n--nn" edc:cname="CM1CON" edc:desc="" edc:impl="0x7fefd3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000000-000000-0--00" edc:name="CM1CON" edc:nzwidth="32" edc:por="---------0000000000-000000-0--00" edc:portals="CLR SET INV" ltx:baseofperipheral="CMP1" edc:_modsrc="DOS-01427_cmp_control_upb_v1_32bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x30" edc:_addr="0x1F82C010">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AMPMOD" edc:desc="" edc:mask="0x1" edc:name="AMPMOD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OAO" edc:desc="" edc:mask="0x1" edc:name="OAO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
