Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="LATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx-xx-xxx---xx" edc:name="LATF" edc:nzwidth="0x20" edc:por="------------------xx-xx-xxx---xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF7" edc:desc="" edc:mask="0x1" edc:name="LATF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF9" edc:desc="" edc:mask="0x1" edc:name="LATF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATF10" edc:desc="" edc:mask="0x1" edc:name="LATF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATF12" edc:desc="" edc:mask="0x1" edc:name="LATF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATF13" edc:desc="" edc:mask="0x1" edc:name="LATF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="ODCF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860540">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF6" edc:desc="" edc:mask="0x1" edc:name="ODCF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF7" edc:desc="" edc:mask="0x1" edc:name="ODCF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF9" edc:desc="" edc:mask="0x1" edc:name="ODCF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF10" edc:desc="" edc:mask="0x1" edc:name="ODCF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF12" edc:desc="" edc:mask="0x1" edc:name="ODCF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCF13" edc:desc="" edc:mask="0x1" edc:name="ODCF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNPUF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNPUF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860550">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUF0" edc:desc="" edc:mask="0x1" edc:name="CNPUF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF1" edc:desc="" edc:mask="0x1" edc:name="CNPUF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF5" edc:desc="" edc:mask="0x1" edc:name="CNPUF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF6" edc:desc="" edc:mask="0x1" edc:name="CNPUF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF7" edc:desc="" edc:mask="0x1" edc:name="CNPUF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF9" edc:desc="" edc:mask="0x1" edc:name="CNPUF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF10" edc:desc="" edc:mask="0x1" edc:name="CNPUF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF12" edc:desc="" edc:mask="0x1" edc:name="CNPUF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF13" edc:desc="" edc:mask="0x1" edc:name="CNPUF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNPDF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNPDF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860560">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDF0" edc:desc="" edc:mask="0x1" edc:name="CNPDF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF1" edc:desc="" edc:mask="0x1" edc:name="CNPDF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF5" edc:desc="" edc:mask="0x1" edc:name="CNPDF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF6" edc:desc="" edc:mask="0x1" edc:name="CNPDF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF7" edc:desc="" edc:mask="0x1" edc:name="CNPDF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF9" edc:desc="" edc:mask="0x1" edc:name="CNPDF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF10" edc:desc="" edc:mask="0x1" edc:name="CNPDF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF12" edc:desc="" edc:mask="0x1" edc:name="CNPDF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF13" edc:desc="" edc:mask="0x1" edc:name="CNPDF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONF" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860570">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE F" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc036e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNENF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860580">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF6" edc:desc="" edc:mask="0x1" edc:name="CNIEF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF7" edc:desc="" edc:mask="0x1" edc:name="CNIEF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF9" edc:desc="" edc:mask="0x1" edc:name="CNIEF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF10" edc:desc="" edc:mask="0x1" edc:name="CNIEF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF12" edc:desc="" edc:mask="0x1" edc:name="CNIEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF13" edc:desc="" edc:mask="0x1" edc:name="CNIEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
