Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr--" edc:cname="C1FIFOUA15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuu00" edc:name="C1FIFOUA15" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F880730">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOUA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F880740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880750"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880760"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880770"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880780"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880790"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8807F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880800"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880810"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880820"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880830"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880840"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880850"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880860"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880870"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880880"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880890"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8808F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880900"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880910"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880920"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880930"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880940"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880950"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880960"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880970"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880980"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880990"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8809F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A40"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A50"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A60"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A70"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A80"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880A90"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AA0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AB0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AC0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AD0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AE0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880AF0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880B00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880B10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880B20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880B30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F880B40"/>
      <edc:AdjustPoint edc:offset="1200" edc:_addr="0x1F880B50"/>
      <edc:SFRDef edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C2CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C2CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN2" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F881000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN2" edc:pos="14"/>
      </edc:SFRDef>
