Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881750"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881760"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881770"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881780"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881790"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8817F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881800"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881810"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881820"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881830"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881840"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881850"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881860"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881870"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881880"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881890"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8818F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881900"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881910"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881920"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881930"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881940"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881950"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881960"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881970"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881980"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881990"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8819F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A40"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A50"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A60"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A70"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A80"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881A90"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AA0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AB0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AC0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AD0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AE0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881AF0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881B00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881B10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881B20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881B30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F881B40"/>
      <edc:AdjustPoint edc:offset="0x24b0" edc:_addr="0x1F881B50"/>
      <edc:SFRDef edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C3CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C3CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN3" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------n---nnnnnnnnnnnnnnnnnnn" edc:cname="C3CFG" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0---0000000000000000000" edc:name="C3CFG" edc:nzwidth="0x20" edc:por="---------0---0000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
