Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXM0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3RXM0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXM1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3RXM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXM2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3RXM2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXM3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3RXM3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C3FLTCON0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3FLTCON0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL0" edc:desc="" edc:mask="0x1f" edc:name="FSEL0" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL0" edc:desc="" edc:mask="0x3" edc:name="MSEL0" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN0" edc:desc="" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL1" edc:desc="" edc:mask="0x1f" edc:name="FSEL1" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL1" edc:desc="" edc:mask="0x3" edc:name="MSEL1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN1" edc:desc="" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL2" edc:desc="" edc:mask="0x1f" edc:name="FSEL2" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL2" edc:desc="" edc:mask="0x3" edc:name="MSEL2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN2" edc:desc="" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL3" edc:desc="" edc:mask="0x1f" edc:name="FSEL3" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL3" edc:desc="" edc:mask="0x3" edc:name="MSEL3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN3" edc:desc="" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C3FLTCON1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3FLTCON1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL4" edc:desc="" edc:mask="0x1f" edc:name="FSEL4" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL4" edc:desc="" edc:mask="0x3" edc:name="MSEL4" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN4" edc:desc="" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL5" edc:desc="" edc:mask="0x1f" edc:name="FSEL5" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL5" edc:desc="" edc:mask="0x3" edc:name="MSEL5" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN5" edc:desc="" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL6" edc:desc="" edc:mask="0x1f" edc:name="FSEL6" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL6" edc:desc="" edc:mask="0x3" edc:name="MSEL6" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN6" edc:desc="" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL7" edc:desc="" edc:mask="0x1f" edc:name="FSEL7" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL7" edc:desc="" edc:mask="0x3" edc:name="MSEL7" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN7" edc:desc="" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C3FLTCON2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3FLTCON2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL8" edc:desc="" edc:mask="0x1f" edc:name="FSEL8" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL8" edc:desc="" edc:mask="0x3" edc:name="MSEL8" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:desc="" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL9" edc:desc="" edc:mask="0x1f" edc:name="FSEL9" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL9" edc:desc="" edc:mask="0x3" edc:name="MSEL9" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:desc="" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL10" edc:desc="" edc:mask="0x1f" edc:name="FSEL10" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL10" edc:desc="" edc:mask="0x3" edc:name="MSEL10" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:desc="" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL11" edc:desc="" edc:mask="0x1f" edc:name="FSEL11" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL11" edc:desc="" edc:mask="0x3" edc:name="MSEL11" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:desc="" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
