Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK0512MCF100.PIC
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F8C74"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT3WR1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3WR1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="58" edc:_begin="0x20" edc:_end="0x24" edc:_addr="0x1F8F8C78">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F8C7C"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT3REG2" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT3REG2" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="59" edc:_begin="0x18" edc:_end="0x1c" edc:_addr="0x1F8F8C80">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="12" edc:_addr="0x1F8F8C84"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT3RD2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3RD2" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="60" edc:_begin="0x1c" edc:_end="0x20" edc:_addr="0x1F8F8C90">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F8C94"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT3WR2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3WR2" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="61" edc:_begin="0x20" edc:_end="0x24" edc:_addr="0x1F8F8C98">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <edc:VirtualPin edc:name="RG15"/>
      <edc:VirtualPin edc:name="PMA23"/>
      <edc:VirtualPin edc:name="AN23"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="PWM4L"/>
      <edc:VirtualPin edc:name="PWM10H"/>
      <edc:VirtualPin edc:name="RPA7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="VBUSON1"/>
      <edc:VirtualPin edc:name="PWM1H"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="PWM1L"/>
      <edc:VirtualPin edc:name="PWM7H"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="PWM5L"/>
      <edc:VirtualPin edc:name="PWM11H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PWM5H"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PWM6L"/>
      <edc:VirtualPin edc:name="PWM12H"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="4" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PWM6H"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="VBUSON2"/>
      <edc:VirtualPin edc:name="RPG6" edc:ppsgroup="1" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN19"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="RPG7" edc:ppsgroup="2" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN18"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="RPG8" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN17"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPG9" edc:ppsgroup="4" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN16"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG10"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE8"/>
      <edc:VirtualPin edc:name="AN21"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE9"/>
      <edc:VirtualPin edc:name="AN20"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA12"/>
      <edc:VirtualPin edc:name="USBOEN2"/>
      <edc:VirtualPin edc:name="RPA12" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA11"/>
      <edc:VirtualPin edc:name="USBOEN1"/>
      <edc:VirtualPin edc:name="RPA11" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="RPA0" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="C4IN3-"/>
      <edc:VirtualPin edc:name="C2IN4-"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="OA2OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="RPA1" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="C2IN1+"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="OA2IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="OA2IN-"/>
      <edc:VirtualPin edc:name="PGED3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C4IN2-"/>
      <edc:VirtualPin edc:name="C1IN4-"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="OA1OUT"/>
      <edc:VirtualPin edc:name="PGEC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C1IN1+"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="OA1IN+"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="OA1IN-"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="AN33"/>
      <edc:VirtualPin edc:name="Vref-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF10"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="AN34"/>
      <edc:VirtualPin edc:name="Vref+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0"/>
      <edc:VirtualPin edc:name="RPC0" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="C4IN4-"/>
      <edc:VirtualPin edc:name="C4IN1+"/>
      <edc:VirtualPin edc:name="C3IN4-"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OA3OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="C4IN1-"/>
      <edc:VirtualPin edc:name="C3IN1-"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="OA3IN-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="FLT3"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="C3IN3-"/>
      <edc:VirtualPin edc:name="C3IN1+"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="OA3IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="FLT4"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG11"/>
      <edc:VirtualPin edc:name="AN35"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="AN36"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="AN37"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="FLT5"/>
      <edc:VirtualPin edc:name="C5IN2-"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="FLT6"/>
      <edc:VirtualPin edc:name="C3IN2-"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="FLT7"/>
      <edc:VirtualPin edc:name="RPE14" edc:ppsgroup="3" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="FLT8"/>
      <edc:VirtualPin edc:name="RPE15" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="AN38"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="AN39"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA8"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RPA8" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN26"/>
      <edc:VirtualPin edc:name="DAC3"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RPB4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="FLT15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T1G"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPA4" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="C5IN3-"/>
      <edc:VirtualPin edc:name="C5IN1+"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="DAC1"/>
      <edc:VirtualPin edc:name="OA5IN+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="RPE0" edc:ppsgroup="1" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN40"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="RPE1" edc:ppsgroup="2" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN41"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D1-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D1+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBUS2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D2-"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D2+"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="RPC12" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AN49"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="RPC15" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSCO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="2" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN46"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="1" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN47"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="USBID1"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC10"/>
      <edc:VirtualPin edc:name="PSPCS"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="RPC10" edc:ppsgroup="4" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN48"/>
      <edc:VirtualPin edc:name="DAC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="C5IN4-"/>
      <edc:VirtualPin edc:name="AN25"/>
      <edc:VirtualPin edc:name="OA5OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="6" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="5" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="4" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="C5IN1-"/>
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="OA5IN-"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC6"/>
      <edc:VirtualPin edc:name="PMA16"/>
      <edc:VirtualPin edc:name="USBID2"/>
      <edc:VirtualPin edc:name="RPC6" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC7"/>
      <edc:VirtualPin edc:name="PMA17"/>
      <edc:VirtualPin edc:name="RPC7" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="PMD13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC8"/>
      <edc:VirtualPin edc:name="PSPWR"/>
      <edc:VirtualPin edc:name="PMPWR"/>
      <edc:VirtualPin edc:name="RPC8" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PSPRD"/>
      <edc:VirtualPin edc:name="PMPRD"/>
      <edc:VirtualPin edc:name="PWM12H"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="1" edc:ppsval="9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="PWM12L"/>
      <edc:VirtualPin edc:name="RPD6" edc:ppsgroup="2" edc:ppsval="9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC9"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="RPC9" edc:ppsgroup="4" edc:ppsval="5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="PWM11H"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="3" edc:ppsval="12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="PWM11L"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="RPG1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="RPG0" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="PMA18"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="PMA19"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="PWM3H"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="PWM3L"/>
      <edc:VirtualPin edc:name="PWM9H"/>
      <edc:VirtualPin edc:name="RPB11" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="PMA20"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG12"/>
      <edc:VirtualPin edc:name="PMA21"/>
      <edc:VirtualPin edc:name="RPG12" edc:ppsgroup="4" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG13"/>
      <edc:VirtualPin edc:name="PMA22"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="PWM2H"/>
      <edc:VirtualPin edc:name="RPB12" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="PWM2L"/>
      <edc:VirtualPin edc:name="PWM8H"/>
      <edc:VirtualPin edc:name="RPB13" edc:ppsgroup="3" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="PWM4H"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
